package com.kh.quize;

public class C_array {
	
	public static void main(String[] args) {
		
	}
	
	//[문제]
	//크기가 10인 int[]을 선언, 할당하고
	//1~100 사이의 임의의 정수를 발생시켜, 배열 공간에 기록하시오
	//기록된 10개의 값 중 가장 큰 값과 가장 작은 값을 알아내어
	//[출력양식] min : 1, max : 100 과 같은 형식으로 출력하시오.
	//메서드명 : test1
	//hint : Math클래스의 random 메서드를 활용하면 임의의 정수를 발생시킬 수 있다.
	public void q1() {
	
	}
	
	//크기가 10인 int[]를 3개 생성하세요.
	//각 int[]을 1~95 사이의 임의의 수로 초기화 하세요.
	//3개 int[]에 들어있는 숫자들 중에서 7,8,9번째로 작은 수를 구하세요
	// ex) [1,2,3,3] [4,5,5,6] [6,6,8,9]
	//[출력양식]	7번째 : 5
	//			8번째 : 6
	//			9번째 : 6
	public void q2() {
		
	}
}
